# Отримуємо вхідне число від користувача
num = int(input("Введіть число від 0 до 100: "))

# Ініціалізуємо змінну sum для обчислення суми чисел
sum = 0

# Перевіряємо, чи число знаходиться в діапазоні від 0 до 100
if 0 <= num <= 100:
    # Використовуємо цикл while для обчислення суми чисел
    i = 1  # Початкове значення для лічильника
    while i <= num:
        sum += i # (sum = i + sum)
        i += 1  # Збільшуємо лічильник на 1 після кожного кроку (i = i + 1)
    # Виводимо результат
    print("Сума чисел від 1 до", num, "дорівнює", sum)
else:
    print("Введене число не знаходиться в діапазоні від 0 до 100.")

def exit():
    while True:
        user_input = input()
        if user_input != "exit":
            print ('Type exit if you want to exit')
            print(user_input)
        if user_input == "exit":
            break