'''Цикл for може бути використаний для здійснення ітерацій за ключами словника, як показано нижче. 
На кожній ітерації ключ словника зберігається у внутрішній змінній циклу l.'''

lang = {"Python": 1991, "Java": 1995, "JS": 1995}
for l in lang:
    print(l)

# или так

lang = {"Python": 1991, "Java": 1995, "JS": 1995}
for l in lang.keys():
    print(l)

'''Циклом for також можна скористатися для здійснення ітерацій за значеннями словника. 
Це робиться за допомогою методу values, що створює колекцію значень словника.'''

lang = {"Python": 1991, "Java": 1995, "JS": 1995}
for value in lang.values():
    print(value)
