'''У нас є список показань заборгованостей з комунальних послуг наприкінці місяця. 
Заборгованості можуть бути від'ємними — у нас переплата, чи додатними, якщо необхідно сплатити за рахунками. 
Напишіть функцію amount_payment, яка приймає на вхід список платежів, 
підсумовує додатні значення та повертає суму платежу наприкінці місяця.'''


def amount_payment(payment):
    sum = 0
    for value in payment:
        if value > 0:
            sum = sum + value
    return sum

payment = [-100, 50, -20, 30, -10]
result = amount_payment(payment)
print(f"Сума платежу наприкінці місяця: {result}")